Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_ОбменДаннымиСерверПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ЗагрузитьДанныеДокументов(МобильноеУстройство, ДанныеДокументов) Экспорт
	
	ТипЗначенияДанныеДокументов = ТипЗнч(ДанныеДокументов);
	
	Если ПолучитьФункциональнуюОпцию("SUI_ОнлайнОбмен") И ТипЗначенияДанныеДокументов = Тип("Строка") Тогда
		
		ДанныеДокументов = SUI_СообщенияОбменаДанными.ВосстановитьСжатуюСтроку(ДанныеДокументов);
		Если Не ПустаяСтрока(ДанныеДокументов) Тогда
			ДанныеДокументов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеДокументов, Ложь, , ,
				"ВосстановлениеДанныхJSON_ДанныеДокумента", SUI_ОбменДаннымиСервер);
			ТипЗначенияДанныеДокументов = ТипЗнч(ДанныеДокументов);
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru = 'Тип данных документов должен быть типом ""Структура"".
	|Полученный тип: ""%1""'");
	ТекстОшибки = СтрШаблон(ТекстОшибки, ТипЗначенияДанныеДокументов);
	ОбщегоНазначенияКлиентСервер.Проверить(ТипЗначенияДанныеДокументов = Тип("Структура"),
		ТекстОшибки, "SUI_ОбменДаннымиСерверПереопределяемый.ЗагрузитьДанныеДокументов");
	
	РезультатЗагрузки = Новый Структура();
	РезультатЗагрузки.Вставить("total", 1);
	РезультатЗагрузки.Вставить("quantity_uploaded", 0);
	РезультатЗагрузки.Вставить("result", Ложь);
	
	ПараметрыЗагрузки = SUI_ДокументыОбмена.ПараметрыЗагрузкиДокументаОбмена();
	ПараметрыЗагрузки.МобильноеУстройство = МобильноеУстройство;
	ПараметрыЗагрузки.Данные.id_doc = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеДокументов, "id_doc", "", Тип("Строка"));
	
	ТекстОшибки = НСтр("ru = 'Не известный идентификатор документа ""%1""'");
	ТекстОшибки = СтрШаблон(ТекстОшибки, ПараметрыЗагрузки.Данные.id_doc);
	ОбщегоНазначенияКлиентСервер.Проверить(
		SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ПараметрыЗагрузки.Данные.id_doc),
		ТекстОшибки, "SUI_ОбменДаннымиСерверПереопределяемый.ЗагрузитьДанныеДокументов");
	
	Если ДанныеДокументов.Свойство("RS_docs_table") Тогда
		ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары,
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументов, "RS_docs_table",
			SUI_ДокументыОбмена.ТаблицаТоварыДокументаОбмена()));
	ИначеЕсли ДанныеДокументов.Свойство("RS_adr_docs_table") Тогда
		ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары,
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументов, "RS_adr_docs_table",
			SUI_ДокументыОбмена.ТаблицаТоварыДокументаОбмена()));
	КонецЕсли;
	
	ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии,
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДокументов, "RS_docs_series", SUI_ДокументыОбмена.ТаблицаСерииДокументаОбмена()));
		
	ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок,
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДокументов, "RS_docs_barcodes", SUI_ДокументыОбмена.ТаблицаШтрихкодыДокументаОбмена()));
		
	ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов,
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДокументов, "RS_barc_flow", SUI_ДокументыОбмена.ТаблицаПотокШтрихкодовОбмена()));
	
	Если SUI_ДокументыОбмена.ЗагрузитьДокументОбмена(ПараметрыЗагрузки) Тогда
		РезультатЗагрузки.quantity_uploaded = 1;
	КонецЕсли;
	
	РезультатЗагрузки.result = (РезультатЗагрузки.total > 0 И РезультатЗагрузки.quantity_uploaded > 0);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

#КонецОбласти
